Enums/СтатусыЗаказовТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказовТорговыхПлощадок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОжидаетСборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГотовКОтгрузке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятВДоставку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПунктеВыдачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаказовТорговыхПлощадок/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает представление схемы работы для учетной записи маркетплейса.
//
// Параметры:
//   Представление - Строка - представление статуса отправления на торговой площадке.
//   Уточнение     - Строка - представление субстатуса отправления на торговой площадке.
//
// Возвращаемое значение:
//   ПеречислениеСсылка.СтатусыЗаказовТорговыхПлощадок - статус заказа в учетной системе.
//
Функция ПолучитьПоПредставлению(Знач Представление, Знач Уточнение = "") Экспорт
	
	Результат     = Перечисления.СтатусыЗаказовТорговыхПлощадок.ПустаяСсылка();
	Представление = ВРег(Представление);
	Уточнение     = ВРег(Уточнение);
	
	Если Представление = ВРег("acceptance_in_progress") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.ПринятВДоставку;
	ИначеЕсли Представление = ВРег("arbitration") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Доставляется;
	ИначеЕсли Представление = ВРег("awaiting_approve") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки;
	ИначеЕсли Представление = ВРег("awaiting_deliver") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.ГотовКОтгрузке;
	ИначеЕсли Представление = ВРег("awaiting_packaging") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки;
	ИначеЕсли Представление = ВРег("awaiting_registration") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки;
	ИначеЕсли Представление = ВРег("awaiting_verification") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.ОжидаетСборки;
	ИначеЕсли Представление = ВРег("cancelled") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Отменен;
	ИначеЕсли Представление = ВРег("cancelled_from_split_pending") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Отменен;
	ИначеЕсли Представление = ВРег("client_arbitration") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Доставлен;
	ИначеЕсли Представление = ВРег("delivering") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Доставляется;
	ИначеЕсли Представление = ВРег("driver_pickup") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Доставляется;
	ИначеЕсли Представление = ВРег("delivered") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Доставлен;
	ИначеЕсли Представление = ВРег("not_accepted") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Доставляется;
	ИначеЕсли Представление = ВРег("sent_by_seller") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.Доставляется;
	КонецЕсли;
	
	Если Уточнение = ВРег("posting_in_pickup_point") Тогда
		Результат = Перечисления.СтатусыЗаказовТорговыхПлощадок.ВПунктеВыдачи;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Заполняет список выбора статусами заказов.
// Параметры:
//   СписокВыбора           - СписокЗначений Из ПеречислениеСсылка.СтатусыЗаказовТорговыхПлощадок - список для  
//                              заполнения доступных значений выбора.
//   ДобавитьПустоеЗначение - Булево - признак добавления значения "Все".
//
Процедура ЗаполнитьСписокВыбора(СписокВыбора, ДобавитьПустоеЗначение = Истина) Экспорт
	
	СписокВыбора.Очистить();
	
	Если ДобавитьПустоеЗначение Тогда
		СписокВыбора.Добавить(Перечисления.СтатусыЗаказовТорговыхПлощадок.ПустаяСсылка(), НСтр("ru = 'Все'"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтатусыЗаказовТорговыхПлощадок.Ссылка КАК Ссылка,
		|	ПРЕДСТАВЛЕНИЕ(СтатусыЗаказовТорговыхПлощадок.Ссылка) КАК Представление
		|ИЗ
		|	Перечисление.СтатусыЗаказовТорговыхПлощадок КАК СтатусыЗаказовТорговыхПлощадок
		|
		|УПОРЯДОЧИТЬ ПО
		|	СтатусыЗаказовТорговыхПлощадок.Порядок";
	
	ВыборкаДанных = Запрос.Выполнить().Выбрать();
	Пока ВыборкаДанных.Следующий() Цикл
		СписокВыбора.Добавить(ВыборкаДанных.Ссылка, ВыборкаДанных.Представление);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
